app/views/videos/_vidplayer.html.erb

SELECT `videos`.* FROM `videos` ORDER BY points DESC
---
    <script>
     $(document).ready(function() {
        x = $("#background_overlay iframe").attr("title");
        y=$("#video_container h3").html().substring(1,4);

               if(y=="Top" | y=="New"){
       	y="t";
       }else if(y=="lea"){
       	y="l";
       }else{
       	y="u";
       }
    if($.cookie("zomg"))
    {
    	$.removeCookie('zomg');
    }else{
	window.history.pushState({state:x}, "Video", "/"+y+"?video="+x);
	}
    $(".items_inner div img").click(function(){
				$('html,body').animate({scrollTop:$('#video_container').offset().top}, 500)
  	});
  			$('div.items_description').each(function(){