app/views/user/_id_card.html.erb


 <% @selected_user.videos.order("points DESC").first(5).each do |video| %>
---
SELECT "videos".* FROM "videos" WHERE "videos"."user_id" = 3 ORDER BY points DESC LIMIT 5