app/views/user/_leader.html.erb

				<ol>
    <% user.videos.order("points DESC").each do |video| %>
---
SELECT `videos`.* FROM `videos` WHERE `videos`.`user_id` = 1 ORDER BY points DESC