app/controllers/sessions_controller.rb

def verify
   user = User.find_by_email(params[:session][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'abberger2@wisc.edu' LIMIT 1