app/controllers/user_controller.rb

INSERT INTO "users" ("about", "activated", "avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "email", "hasVideo", "major", "name", "password_digest", "points", "remember_token", "skill", "updated_at", "year") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
def create
    @user = User.new(params[:user])
     if @user.valid?
        @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "users" SET "avatar_file_name" = 'berger.jpg', "avatar_content_type" = 'image/jpeg', "avatar_file_size" = 48553, "avatar_updated_at" = '2012-12-20 21:45:46.575034', "remember_token" = '305d1401004f9db6e9d9b7413d89d369', "updated_at" = '2012-12-20 21:45:47.256668' WHERE "users"."id" = 1
---
def update
    @user = User.find(params[:id])
    @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "users" SET "year" = 'Junior', "major" = 'Bio', "skill" = 'Longboarding', "about" = 'I like shredding those slopes', "remember_token" = 'ce1610211ddb6f49c37453b58e25065d', "updated_at" = '2012-12-21 01:11:36.886777' WHERE "users"."id" = 1
---
def prof_update
   @user = User.find(params[:id])
   if @user.update_attributes(params[:user])

SELECT `videos`.* FROM `videos` WHERE `videos`.`user_id` = 1 ORDER BY points DESC
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "4"]]
SELECT "users".* FROM "users" WHERE "users"."hasVideo" = 't' ORDER BY points DESC
---
def index
    if params[:user_id] == nil
      @video_list = Video.order("points DESC").limit(15)
      @myVid = false
    else
      @user = User.find(params[:user_id])
      sign_in(@user)
      @myVid = true
      @video_list = @user.videos
   end

     @user_list = User.order("points DESC").where(:hasVideo => true)

SELECT "users".* FROM "users" WHERE "users"."email" = 'abberger2@wisc.edu' LIMIT 1
---
def check_email

    @user= User.find_by_email(params[:user][:email])

SELECT `users`.* FROM `users` WHERE `users`.`name` = 'Cartman' LIMIT 1
---
def check_name
   @user= User.find_by_name(params[:user][:name])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."hasVideo" = 't' ORDER BY points DESC
---
def select_user

 if params[:user] != nil
    @selected_user = User.find(params[:user])
 else
  @users = User.where(:hasVideo => true)