app/controllers/videos_controller.rb

INSERT INTO `videos` (`created_at`, `description`, `is_complete`, `points`, `title`, `updated_at`, `user_id`, `yt_video_id`) VALUES ('2012-12-16 04:52:52', 'asd', 0, 0, 'asd', '2012-12-16 04:52:52', NULL, NULL)
---
def upload

    @video = Video.create(params[:video])							# creates video

SELECT "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", "3"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "hasVideo" = 't', "remember_token" = '00b0ed2353d91ec6451a4a655965952f', "updated_at" = '2012-12-18 02:12:54.601677' WHERE "users"."id" = 1
UPDATE "videos" SET "yt_video_id" = 'OW_kM7lKGdg', "is_complete" = 't', "user_id" = 1, "updated_at" = '2012-12-18 02:12:54.592500' WHERE "videos"."id" = 3
DELETE FROM "videos" WHERE "videos"."id" = $1  [["id", 1]]
---
def save_video

      @video = Video.find(params[:video_id])
      @user = User.find(current_user.id)
      @video.update_attributes(:yt_video_id =>params[:id].to_s, :is_complete => true, :user_id => current_user.id)
      if params[:status].to_i == 200
         Video.delete_incomplete_videos

SELECT "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", "4"]]
---
def vid_swap

 @current_video = Video.find(params[:video])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT `videos`.* FROM `videos` WHERE `videos`.`user_id` = 1 ORDER BY points DESC
SELECT "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", "5"]]
---
def vid_bank

    if params[:user_id] == nil
       if params[:new] != nil
          @video_list = Video.where("yt_video_id is not null").order("created_at DESC")
          @bank = "New Videos"
       else
 	 if params[:leaderboard] != nil && params[:leaderboard] != "All Leaderboards"
          @video_list = Leaderboard.find_by_leaderboard_name(params[:leaderboard]).videos.order("points DESC")
	  @board = "leaderboard"
          @bank = "#{params[:leaderboard]}'s Videos"
	 else
          @video_list = Video.where("yt_video_id is not null").order("points DESC").limit(15)
          @bank = "Top Videos"
         end
       end
     else
          @user = User.find(params[:user_id])
          @video_list = @user.videos.order("points DESC")
          @bank = "#{@user.name}'s Videos"
    end


   if params[:video] != nil
    @current_video = Video.find(params[:video])