app/controllers/votes_controller.rb

SELECT "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", "5"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT `votes`.* FROM `votes` WHERE (user_id = 4 AND video_id = 14)
INSERT INTO "votes" ("user_id", "video_id", "voted_down", "voted_up") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["video_id", 5], ["voted_down", false], ["voted_up", true]]
UPDATE "videos" SET "points" = 1, "updated_at" = '2012-12-21 01:10:13.871585' WHERE "videos"."id" = 5
UPDATE `users` SET `points` = 2 WHERE `users`.`id` = 4
---
def add_vote
  @video = Video.find(params[:video]) # get current video
  @voter = User.find(params[:voter])  # get current voter
  @owner = User.find(params[:owner])  # get current video's owner
  @vote = Votes.find_vote(@voter.id, @video.id)[0] # check if the user has voted on the video before

  if    @vote == nil # if not add voter/video to vote table
	@vote = Votes.new
	@vote.user_id = @voter.id
	@vote.video_id = @video.id
	@vote.voted_up = true
	@vote.save